controllers/TodoController.php

INSERT INTO `todo` (`category_id`, `name`) VALUES (1, 'jhj')
---
    public function actionCreate()
    {
        $model = new Todo();

        if ($this->request->isPost) {
            if ($model->load($this->request->post()) && $model->save()) {

SELECT * FROM `todo` WHERE `id`='40'
---
    protected function findModel($id)
    {
        if (($model = Todo::findOne(['id' => $id])) !== null) {