models/Todo.php

    public function getAllCategories()
    {
        return ArrayHelper::Map(Category::find()->all(), 'id', 'name');
---
SELECT * FROM `category`